package ru.mail.polis.homework.concurrency.state;

import java.util.ArrayList;
import java.util.List;
import java.util.Random;
import java.util.concurrent.CountDownLatch;
import java.util.concurrent.Executor;
import java.util.concurrent.Executors;
import java.util.concurrent.TimeUnit;
import java.util.function.BinaryOperator;
import java.util.function.UnaryOperator;


/**
 * Класс, который упраялвет контейнерами и умеет их инициализировать, запускать, финишировать и закрывать.
 * Делает все это параллельно, то есть может использоваться из многих потоков.
 *
 * Это задание на 2 балла за каждый метод. Конструктор на 1 балл
 * Max 11 баллов
 */
public class ContainerManager {

    private final static double CONTAINER_INITIAL_VALUE = 5d;
    private final static int QUANTITY_OF_OPERATIONS = 10_000;

    private final List<CalculateContainer<Double>> calculateContainers;
    private final CountDownLatch latch;

    private final Executor initialExecutor;
    private final Executor runAndFinishExecutor;
    private final Executor closeExecutor;

    private final Random randomizer = new Random();


    /**
     * Создайте список из непустых контейнеров
     */
    public ContainerManager(int containersCount) {
        this.calculateContainers = new ArrayList<>(containersCount);
        for (int i = 0; i < containersCount; i++) {
            calculateContainers.add(new CalculateContainer<>(CONTAINER_INITIAL_VALUE));
        }
        latch = new CountDownLatch(containersCount);
        initialExecutor = Executors.newCachedThreadPool();
        runAndFinishExecutor = Executors.newFixedThreadPool(2);
        closeExecutor = Executors.newSingleThreadExecutor();
    }


    /**
     * Используйте executor c расширяемым количеством потоков,
     * который будет инициировать все контейнеры, какой-нибудь математической операцией 1_000_000 раз.
     * (для этого используйте вспомогательный метод operation)
     *
     * Каждый контейнер надо исполнять отдельно.
     */
    public void initContainers() {
        UnaryOperator<Double> initialOperator = operation(Math::sqrt);
        for (CalculateContainer<Double> container : calculateContainers) {
            for (int i = 0; i < QUANTITY_OF_OPERATIONS; i++) {
                initialExecutor.execute(() -> container.init(initialOperator));
            }
        }
    }


    /**
     * Используйте executor c 2 потоками (общий с операцией finish),
     * который будет запускать все контейнеры какой-нибудь математической операцией 1_000_000 раз
     * (для этого используйте вспомогательный метод operation)
     *
     * Каждый контейнер надо исполнять отдельно.
     */
    public void runContainers() {
        BinaryOperator<Double> runOperator = operation((a, b) -> Math.cos(a * b));
        for (CalculateContainer<Double> container : calculateContainers) {
            for (int i = 0; i < QUANTITY_OF_OPERATIONS; i++) {
                double randomDouble = randomizer.nextDouble();
                runAndFinishExecutor.execute(() -> container.run(runOperator, randomDouble));
            }
        }
    }


    /**
     * Используйте executor c 2 потоками (общий с операцией run), который будет принимать
     * элемент из контейнеров и печатать их с соответствующим текстом об совершенных операциях
     *
     * Каждый контейнер надо исполнять отдельно.
     */
    public void finishContainers() {
        for (CalculateContainer<Double> container : calculateContainers) {
            runAndFinishExecutor.execute(() -> container.finish(result -> System.out.println(container + " finished calculating. Result: " + result)));
        }
    }


    /**
     * Используйте executor c 1 потоком, который будет принимать элемент из контейнеров
     * и печатать их с соответствующим текстом о закртыии.
     *
     * Каждый контейнер надо исполнять отдельно.
     *
     * Так как этот метод переводит контейнер в закрытое состояине,
     * то нужно добавить некоторую синхронизацию, которая разблокируется,
     * как только закроются все 10 контейеров
     */
    public void closeContainers() {
        for (CalculateContainer<Double> container : calculateContainers) {
            closeExecutor.execute(() -> {
                container.close(result -> System.out.println(container + " closed. result: " + result));
            });
            latch.countDown();
        }
    }

    /**
     * Этот метод должен ждать, пока все контейнеры не закроются или пока не закончится время.
     * Если вышло время, то метод должен вернуть false, иначе true.
     *
     * Почти все методы ожидания, которые реализованы в Java умеют ждать с таймаутом.
     * Учтите, что время передается в милисекундах.
     */
    public boolean await(long timeoutMillis) throws Exception {
        return latch.await(timeoutMillis, TimeUnit.MILLISECONDS);
    }

    public List<CalculateContainer<Double>> getCalculateContainers() {
        return calculateContainers;
    }

    private  <T> UnaryOperator<T> operation(UnaryOperator<T> operator) {
        return param -> {
            T result = param;

            for (int i = 0; i < 1000; i++) {
                result = operator.apply(result);
            }
            return result;
        };
    }

    private <T> BinaryOperator<T> operation(BinaryOperator<T> operator) {
        return (start, delta) -> {
            T result = start;
            for (int i = 0; i < 1000; i++) {
                result = operator.apply(result, delta);
            }
            return result;
        };
    }

}
